app/controllers/toys_controller.rb

SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @toy = Toy.find(params[:id])

SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = 15  [["pokemon_id", 6], ["updated_at", "2015-01-27 01:12:01.375280"]]
---
  def update
    @toy = Toy.find(params[:id])
    if @toy.update(toy_params)